-- 무역항 31개 테이블 (HeidiSQL에서 user 계정으로 실행)
USE navigate;

CREATE TABLE IF NOT EXISTS ports (
  port_id INT AUTO_INCREMENT PRIMARY KEY,  -- 번호 (자동 증가)
  name    VARCHAR(50)  NOT NULL,           -- 항 이름
  lat     DECIMAL(9,6) NOT NULL,           -- 위도
  lng     DECIMAL(9,6) NOT NULL            -- 경도
);

INSERT INTO ports (name, lat, lng) VALUES
  ('경인항', 37.561, 126.601),
  ('군산항', 35.979, 126.584),
  ('대산항', 37.015, 126.383),
  ('목포항', 34.767, 126.358),
  ('인천항', 37.460, 126.625),
  ('장항항', 36.007, 126.687),
  ('평택·당진항', 36.993, 126.803),
  ('광양항', 34.885, 127.719),
  ('마산항', 35.190, 128.567),
  ('부산항', 35.100, 129.033),
  ('여수항', 34.747, 127.766),
  ('묵호항', 37.553, 129.116),
  ('울산항', 35.502, 129.387),
  ('포항항', 36.032, 129.410),
  ('보령항', 36.399, 126.478),
  ('서울항', 37.527, 126.933),
  ('태안항', 36.909, 126.227),
  ('고현항', 34.897, 128.614),
  ('삼천포항', 34.927, 128.070),
  ('서귀포항', 33.240, 126.564),
  ('옥포항', 34.895, 128.693),
  ('완도항', 34.317, 126.760),
  ('장승포항', 34.869, 128.727),
  ('제주항', 33.522, 126.541),
  ('진해항', 35.133, 128.695),
  ('통영항', 34.840, 128.420),
  ('하동항', 34.975, 127.815),
  ('삼척항', 37.436, 129.192),
  ('속초항', 38.209, 128.595),
  ('옥계항', 37.623, 129.058),
  ('호산항', 37.182, 129.353);
